Config/Documents/ВыводИзОборотаИСМПБГУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыводИзОборотаИСМПБГУ</Name>
			<BasedOn>
				<xr:Item>Document.ВедомостьНаВыдачуМЗНаНуждыУчреждения</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КодыИСМПБГУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаВыводаИзОборота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемноСортовойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторИСМП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМаркировкиККТ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркированнойПродукцииБПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовИСМПБГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыдачуМЗНаНуждыУчреждения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППТорговойТочки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодGTIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ВыводИзОборотаИСМПБГУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры
//  Ссылка  - ДокументСсылка.ТаксировкаПутевогоЛиста - ссылка на текущий документ
//  ДополнительныеСвойства  - Структура - Структура данных для подсистемы печати
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ДобавитьДвиженияРасходОстаткиКодовИСМП(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, ДокументСсылка);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#Область ДляВызоваИзДругихПодсистем

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

Процедура ДобавитьДвиженияРасходОстаткиКодовИСМП(ТаблицыДляДвижений, ДокументСсылка)

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДокументСсылка"		, ДокументСсылка);
	Запрос.УстановитьПараметр("КонтрольКодовИСМП"	, ОбменИСМПБГУ.ВедетсяКонтрольОстатковКодовИСМП(ДокументСсылка.Организация));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВыводИзОборотаИСМПТовары.Ссылка.Дата КАК Период,
	               |	ВыводИзОборотаИСМПТовары.Ссылка.Ссылка КАК Регистратор,
	               |	ВыводИзОборотаИСМПТовары.Ссылка.Организация КАК Организация,
	               |	ВыводИзОборотаИСМПТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ВыводИзОборотаИСМПТовары.Количество) КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ВыводИзОборотаИСМПТовары.Ссылка.ОбъемноСортовойУчет
	               |			ТОГДА ВыводИзОборотаИСМПТовары.КодGTIN
	               |		ИНАЧЕ ВыводИзОборотаИСМПТовары.КодМаркировки
	               |	КОНЕЦ КАК КодИСМП,
	               |	ВыводИзОборотаИСМПТовары.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТТовары
	               |ИЗ
	               |	Документ.ВыводИзОборотаИСМПБГУ.Товары КАК ВыводИзОборотаИСМПТовары
	               |ГДЕ
	               |	ВыводИзОборотаИСМПТовары.Ссылка = &ДокументСсылка
	               |	И &КонтрольКодовИСМП = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыводИзОборотаИСМПТовары.Ссылка.Ссылка,
	               |	ВыводИзОборотаИСМПТовары.Номенклатура,
	               |	ВыводИзОборотаИСМПТовары.Ссылка.Дата,
	               |	ВыводИзОборотаИСМПТовары.Ссылка.Организация,
	               |	ВЫБОР
	               |		КОГДА ВыводИзОборотаИСМПТовары.Ссылка.ОбъемноСортовойУчет
	               |			ТОГДА ВыводИзОборотаИСМПТовары.КодGTIN
	               |		ИНАЧЕ ВыводИзОборотаИСМПТовары.КодМаркировки
	               |	КОНЕЦ,
	               |	ВыводИзОборотаИСМПТовары.НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Период КАК Период,
	               |	ВТТовары.Регистратор КАК Регистратор,
	               |	ВТТовары.Организация КАК Организация,
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ВТТовары.Регистратор.ОбъемноСортовойУчет
	               |			ТОГДА ВТТовары.Количество
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Количество,
	               |	ВТТовары.КодИСМП КАК КодИСМП,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ВТТовары.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ВТТовары КАК ВТТовары
	               |ГДЕ
	               |	ВТТовары.КодИСМП <> """"";   
	
	ТаблицаДвиженийОстаткиКодовИСМП = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений.Вставить("КодыИСМПБГУ", ТаблицаДвиженийОстаткиКодовИСМП);
	Если ТаблицаДвиженийОстаткиКодовИСМП.Количество() > 0 Тогда 
		ОбменИСМПБГУ.ПроверитьОстаткиКодовИСМП(ДокументСсылка, ТаблицаДвиженийОстаткиКодовИСМП);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти  

#КонецЕсли
